app/Libraries/Authentication.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function getCurrentUser()
    {
        if (!$this->isLoggedIn()) {
            return null;
        }
        if ($this->user === null) {
            $model = new \App\Models\UserModel();
            $this->user = $model->find(session()->get('user_id'));

SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'
---
    public function getUserRole()
    {
        if (!$this->isLoggedIn()) {
            return null;
        }
        if ($this->role === null) {
            $model = new \App\Models\RoleModel();
            $this->role = $model->find(session()->get('role_id'));